[
  {
    "id": "project1",
    "name": "Booki",
    "cover": "../images/booki/cover.png",
    "pictures": [
      "../images/booki/desktop.png",
      "../images/booki/tablet.png",
      "../images/booki/large-mobile.png",
      "../images/booki/mobile.png",
      "../images/booki/figma.png"
    ],
    "excerpt": "Intégration responsive du frontend de l'application de location de logements Booki, à partir de la maquette Figma fournie.",
    "description": "Vous débutez votre alternance en tant que développeur web au sein de la start-up Booki. L'entreprise souhaite développer un site internet qui permette aux usagers de trouver des hébergements et activités dans la ville de leur choix. Vous êtes chargé d'intégrer l'interface du site avec du code HTML et CSS, à partir de la maquette Figma fournie par le designer.",
    "skills": "Ce premier projet m'a permis de prendre en main Visual Studio Code (VScode) tout en apprenant les bases du développement web avec HTML et CSS. Tout au long du projet j'ai pu versionner mon code à l'aide de Git et Github, ce qui constitue une base indispensable de tout projet en programmation. Ce projet m'a également appris à suivre une maquette précise (sur Figma) et à programmer de façon responsive (desktop first).",

    "link": "https://github.com/ThibaultGERARDIN/projet2-booki",
    "tags": ["HTML", "CSS", "Git", "VScode", "Figma"]
  },
  {
    "id": "project2",
    "name": "Sophie Buel",
    "cover": "../images/sophie-buel/cover.png",
    "pictures": [
      "../images/sophie-buel/fullpage.png",
      "../images/sophie-buel/login.png",
      "../images/sophie-buel/edit.png",
      "../images/sophie-buel/modal-1.png",
      "../images/sophie-buel/modal-2.png",
      "../images/sophie-buel/modal-3.png"
    ],
    "excerpt": "Création d'une page web dynamique en JavaScript, à partir d'une base Frontend/Backend déjà partiellement développées. Communication avec une API et manipulation du DOM.",
    "description": "Ce projet vous engage à créer une page web dynamique pour le site internet d'une architecte d'intérieur en utilisant JavaScript et en communiquant avec une API. Vous travaillerez sur la partie Front-End du site, où vous développerez la page de présentation des travaux de l'architecte à partir du HTML fourni. Cela impliquera la gestion des événements utilisateurs et la manipulation des éléments du DOM avec JavaScript. Vous créerez également une page de connexion pour l'administrateur du site ainsi qu'une modale permettant d'uploader de nouveaux médias. Ces éléments seront développés from scratch, vous offrant l'opportunité de mettre en pratique vos compétences en JavaScript de manière approfondie.Pour la première fois, vous aurez accès à un code back-end pour tester les fonctionnalités. Vous apprendrez à communiquer avec une API, ce qui est crucial pour les applications web modernes.Vous utiliserez Figma pour accéder aux maquettes, Visual Studio Code pour le développement, et GitHub pour la gestion de version de votre projet.",
    "skills": "Ce projet m'a appris les bases de JavaScript, de la communication avec une API (opérations CRUD) de la gestion du login et d'un mode édition. J'ai également pu apprendre à créer une fenêtre modale, permettant l'ajout et la suppression de projets dans la base de donnée.",

    "link": "https://github.com/ThibaultGERARDIN/projet3-portfolio",
    "tags": ["JavaScript", "API", "CRUD", "DOM", "Modale", "Swagger"]
  },
  {
    "id": "project3",
    "name": "Menu Maker",
    "cover": "../images/menu-maker/cover.png",
    "pictures": [
      "../images/menu-maker/fullpage.png",
      "../images/menu-maker/login.png"
    ],
    "excerpt": "",
    "description": "",
    "skills": "",

    "link": "",
    "tags": ["Gestion Projet", "Notion", "Kanban", "Veille", "Wakelet"]
  }
]
